export const AboutUs = () => {
  return (
    <>
      <div className="container">
        <h2 className="movie-title">Впечатления о проекте</h2>
        <p>
          Добрый день, меня зовут Артем, я откликнулся на данную стажировку в
          надежде сделать проект на vue3 + ts. Но задание на React. Я никогда не
          работал с ним и начал его изучать с нуля за 5 неполных дней, так как
          еще работаю. Я не успел разобраться с фильтрами, маршрутизацию
          настроил, получаю список фильммов из API и есть возможноть добавлять
          их в избранное, так же рабочая пагинация. Если есть возможность, я бы
          взял проект на vue, на vue я подобное написал бы намного быстрее и
          реализовал все функции и требования, так как знаю его.
        </p>
        <p>
          Если у вас будет менторство или какой то наставник я готов изучить
          реакт, в целом это интересный фреймворк, мне понравлиось с ним
          работать, я думаю, что в будущем я буду использовать его. На всякий
          случай оставлю ссылку на{" "}
          <a href="https://github.com/Tema-ilit?tab=repositories">Git Hub</a>
          <br />
          <a href="https://t.me/Tema_ilit">Мой Тг</a>
        </p>
        <p>Спасибо за внимание!</p>
      </div>
    </>
  );
};
